<?php

require __DIR__ . '/etc/bootstrap.php';

if (empty($_POST)) {
    die('請輸入表單');
}

// =============================================================================
// = 自訂使用者清單
// =============================================================================

$users = [

  "student1"=>"1", 
  "student2"=>"2",
  "student3"=>"3",

];

// =============================================================================
// = 處理送來的表單資料
// =============================================================================

$uAccount = $_POST["account"] ?? "";
$uPassword = $_POST["password"] ?? "";

// =============================================================================
// = 驗證使用者
// =============================================================================

// 驗證帳號是否存在
if (! isset($users[$uAccount])) {
    header("Location:login.php?msg=使用者不存在");
    die;
}

// 驗證密碼是否正確
if ($uPassword !== $users[$uAccount]) {
    header("Location:login.php?msg=密碼錯誤");
    die;
}

// 將驗證成功的使用者名稱，保存到 SESSION。
$_SESSION["account"] = $uAccount;
header("Location:stickerPage.php?msg=登入成功");
